In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('data.csv')
data.head()

,area_type,availability,size,society,total_sqft,bath,balcony,price,site_location
0,Super built-up Area,19-Dec,2 BHK,Coomee,1056,2.0,1.0,39.07,Alandi Road
1,Plot Area,Ready To Move,4 Bedroom,Theanmp,2600,5.0,3.0,120.00,Ambegaon Budruk
2,Built-up Area,Ready To Move,3 BHK,NaN,1440,2.0,3.0,62.00,Anandnagar
3,Super built-up Area,Ready To Move,3 BHK,Soiewre,1521,3.0,1.0,95.00,Aundh
4,Super built-up Area,Ready To Move,2 BHK,NaN,1200,2.0,1.0,51.00,Aundh Road

In [3]:
data.shape

(13320, 9)

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   area_type      13320 non-null  object
 1   availability   13320 non-null  object
 2   size           13304 non-null  object
 3   society        7818 non-null   object
 4   total_sqft     13320 non-null  object
 5   bath           13247 non-null  float64
 6   balcony        12711 non-null  float64
 7   price          13320 non-null  float64
 8   site_location  13319 non-null  object
dtypes: float64(3), object(6)
memory usage: 936.7+ KB

In [5]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*20)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
********************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
16-Jul               1
17-Jan               1
14-Nov               1
16-Nov               1
15-Aug               1
Name: availability, Length: 81, dtype: int64
********************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
18 Bedroom       1
14 BHK           1
12 Bedroom       1
13 BHK           1
16 BHK           1
Name: size, dtype: int64
********************
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
AnazaPl     1
Kut 3or     1
Saensar     1
Apion M     1
Ocock R     1
Name: society, Length: 2688, dtype: int64
********************
1200           843
1100           221
1500           205
2400           196
600            180
              ...
20000            1
3435             1
4000 - 4450      1
704              1
763 - 805        1
Name: total_sqft, Length: 2117, dtype: int64
********************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
11.0       3
13.0       3
16.0       2
14.0       1
40.0       1
18.0       1
27.0       1
15.0       1
Name: bath, dtype: int64
********************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
********************
75.00     310
65.00     302
55.00     275
60.00     270
45.00     240
         ...
45.69       1
85.41       1
91.31       1
102.92      1
62.28       1
Name: price, Length: 1994, dtype: int64
********************
Gokhale Nagar          139
Bhavani Peth           139
Bopodi                 139
Bhandarkar Road        139
Baner road             139
                      ...
Senapati Bapat Road    138
Wakadewadi             138
Sahakar Nagar          138
Tilak Road             138
other                    1
Name: site_location, Length: 97, dtype: int64
********************

In [6]:
data.isna().sum()

area_type           0
availability        0
size               16
society          5502
total_sqft          0
bath               73
balcony           609
price               0
site_location       1
dtype: int64

In [7]:
data.drop(columns= ["society","area_type","availability","balcony"],inplace=True)

In [8]:
data.head()

        size total_sqft  bath   price    site_location
0      2 BHK       1056   2.0   39.07      Alandi Road
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk
2      3 BHK       1440   2.0   62.00       Anandnagar
3      3 BHK       1521   3.0   95.00            Aundh
4      2 BHK       1200   2.0   51.00       Aundh Road

In [9]:
data.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13304 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13247 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13319 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [11]:
data["site_location"].value_counts()

Gokhale Nagar          139
Bhavani Peth           139
Bopodi                 139
Bhandarkar Road        139
Baner road             139
                      ...
Senapati Bapat Road    138
Wakadewadi             138
Sahakar Nagar          138
Tilak Road             138
other                    1
Name: site_location, Length: 97, dtype: int64

In [12]:
data["site_location"] = data["site_location"].fillna('Mukund Nagar')

In [13]:
data["size"].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 BHK           2
10 BHK           2
11 Bedroom       2
27 BHK           1
19 BHK           1
43 Bedroom       1
18 Bedroom       1
14 BHK           1
12 Bedroom       1
13 BHK           1
16 BHK           1
Name: size, dtype: int64

In [14]:
data["size"] = data["size"].fillna('2 BHK')

In [15]:
data["bath"].median()

2.0

In [16]:
data["bath"] = data["bath"].fillna(data["bath"].median())

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   size           13320 non-null  object
 1   total_sqft     13320 non-null  object
 2   bath           13320 non-null  float64
 3   price          13320 non-null  float64
 4   site_location  13320 non-null  object
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [18]:
data["bhk"] = data["size"].str.split().str.get(0).astype(int)

In [19]:
data.head()

        size total_sqft  bath   price    site_location  bhk
0      2 BHK       1056   2.0   39.07      Alandi Road    2
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk    4
2      3 BHK       1440   2.0   62.00       Anandnagar    3
3      3 BHK       1521   3.0   95.00            Aundh    3
4      2 BHK       1200   2.0   51.00       Aundh Road    2

In [20]:
data.rename(columns={'site_location':'location'},inplace=True)

In [21]:
data.head()

        size total_sqft  bath   price         location  bhk
0      2 BHK       1056   2.0   39.07      Alandi Road    2
1  4 Bedroom       2600   5.0  120.00  Ambegaon Budruk    4
2      3 BHK       1440   2.0   62.00       Anandnagar    3
3      3 BHK       1521   3.0   95.00            Aundh    3
4      2 BHK       1200   2.0   51.00       Aundh Road    2

In [22]:
data[data["bhk"]>20]

            size total_sqft  bath  price       location  bhk
1718      27 BHK       8000  27.0  230.0  Uruli Devachi   27
4684  43 Bedroom       2400  40.0  660.0  Salunke Vihar   43

In [23]:
data["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [24]:
def convertRange(y):
    x = str(y)
    temp = x.split('-')
    if(len(temp) >1 ):
        mean_Value = (float(temp[0]) + float(temp[1]))/2
#         print(temp,"-----",mean_Value)
        return mean_Value
    else:
        return float(x)
#         print(temp)
# convertRange('115-120-30')

In [25]:
# data["total_sqft"][data["total_sqft"].str.contains('s')]

In [26]:
def seprateQuantity(x):
    temp = [char for char in x]
    print(temp)
    area = []
    acceptedValues = ['1', '2', '3', '4','5', '6', '7', '8','9', '0', '.']
    for value in temp:
        if value in acceptedValues:
            area.append(value)
#     print("".join(area))
    if(str(area[-1]) == '.'):
        area = area[0:-1]
#         print(area)
    final_area = "".join(area)
    return float(final_area)
    
# seprateQuantity('123.4hello.')

In [27]:
data

            size total_sqft  bath   price              location  bhk
0          2 BHK       1056   2.0   39.07           Alandi Road    2
1      4 Bedroom       2600   5.0  120.00       Ambegaon Budruk    4
2          3 BHK       1440   2.0   62.00            Anandnagar    3
3          3 BHK       1521   3.0   95.00                 Aundh    3
4          2 BHK       1200   2.0   51.00            Aundh Road    2
...          ...        ...   ...     ...                   ...  ...
13315  5 Bedroom       3453   4.0  231.00                Pashan    5
13316      4 BHK       3600   5.0  400.00             Paud Road    4
13317      2 BHK       1141   2.0   60.00              Pirangut    2
13318      4 BHK       4689   4.0  488.00          Prabhat Road    4
13319      1 BHK        550   1.0   17.00  Pune Railway Station    1

[13320 rows x 6 columns]

In [34]:
#removing alphabets from the sqft column 

#applying this on 'a','r' and 's'
temp_df = data[data["total_sqft"].str.contains('s') ==True]

#applying function and storing in another column name tt
temp_df['tt'] = temp_df["total_sqft"].apply(seprateQuantity)

# storing all the values in main dataframe
for i in temp_df.index:
    data.loc[i,'total_sqft'] = temp_df.loc[i,'tt']

['3', 'C', 'e', 'n', 't', 's']
['1', '5', '0', '0', 'C', 'e', 'n', 't', 's']

<ipython-input-34-d256a8101aef>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  temp_df['tt'] = temp_df["total_sqft"].apply(seprateQuantity)

In [38]:
data[data["total_sqft"].str.contains('S') ==True]

Empty DataFrame
Columns: [size, total_sqft, bath, price, location, bhk]
Index: []

In [39]:
data["total_sqft"] = data["total_sqft"].apply(convertRange)

In [40]:
data.describe() # some values are less than 200

         total_sqft          bath         price           bhk
count  13320.000000  13320.000000  13320.000000  13320.000000
mean    1555.971707      2.688814    112.565627      2.802778
std     1238.902448      1.338754    148.971674      1.294496
min        1.000000      1.000000      8.000000      1.000000
25%     1100.000000      2.000000     50.000000      2.000000
50%     1275.000000      2.000000     72.000000      3.000000
75%     1679.250000      3.000000    120.000000      3.000000
max    52272.000000     40.000000   3600.000000     43.000000

In [41]:
data[data["total_sqft"] <100]

            size  total_sqft  bath   price         location  bhk
349    3 Bedroom       11.00   3.0   74.00     Narayan Peth    3
410        1 BHK       34.46   1.0   18.50      Ganeshkhind    1
1019   1 Bedroom        5.31   1.0  110.00       Nagar Road    1
1020       1 BHK       15.00   1.0   30.00        Nana Peth    1
1086   2 Bedroom       30.00   2.0   29.50         Gultekdi    2
1122   5 Bedroom       24.00   2.0  150.00           Pashan    5
4086   4 Bedroom        1.00   4.0  120.00   Mangalwar peth    4
4972       7 BHK        5.00   7.0  115.00    Salunke Vihar    7
5453   6 Bedroom        3.00   6.0   75.00      Sasson Road    6
5668   5 Bedroom       45.00   6.0  400.00            Aundh    5
5970   1 Bedroom       45.00   1.0   23.00  Deccan Gymkhana    1
5976       1 BHK       78.03   1.0   63.00     Fatima Nagar    1
6303       3 BHK       84.53   3.0   69.34      Narayangaon    3
6333   2 Bedroom        2.09   2.0  200.00       Wakadewadi    2
6552   5 Bedroom       24.00   6.0  550.00     Fatima Nagar    5
7334   1 Bedroom        2.00   1.0  125.00      Karve Nagar    1
7607   3 Bedroom       15.00   3.0  217.00        Erandwane    3
7726   1 Bedroom        1.26   1.0  125.00   Kondhwa Budruk    1
9423   1 Bedroom        1.00   1.0   48.00             Camp    1
9734       1 BHK       45.06   2.0   18.00      Karve Nagar    1
10488  2 Bedroom        1.25   2.0  200.00     Fatima Nagar    2
10491      2 BHK       86.72   2.0   40.00      Ganeshkhind    2
11320  1 Bedroom       38.00   1.0  170.00   Vadgaon Budruk    1
11558  4 Bedroom       60.00   4.0  218.00      Karve Nagar    4
11615  3 Bedroom        6.00   2.0   80.00            Warje    3
12252      5 BHK       24.00   5.0   75.00       Nagar Road    5

In [49]:
# calculating price per square feet 

data['price_per_sq_ft'] = (data['price']/data['total_sqft'])*100000

<ipython-input-49-4f4ba1bd1373>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['price_per_sq_ft'] = (data['price']/data['total_sqft'])*100000

In [50]:
data.describe()

         total_sqft          bath         price           bhk  price_per_sq_ft
count  12356.000000  12356.000000  12356.000000  12356.000000     12356.000000
mean    1601.373643      2.542975    110.831862      2.633943      6207.721358
std     1268.731502      1.066702    152.758002      0.966175      4046.603744
min      340.000000      1.000000      8.440000      1.000000       267.829813
25%     1115.000000      2.000000     49.000000      2.000000      4200.000000
50%     1305.500000      2.000000     69.500000      3.000000      5264.632169
75%     1708.000000      3.000000    115.000000      3.000000      6825.108836
max    52272.000000     16.000000   3600.000000     16.000000    176470.588235

In [51]:
location_value_counts = data['location'].value_counts()

In [52]:
location_value_counts[location_value_counts<20]

other    1
Name: location, dtype: int64

In [53]:
data['location'] = data['location'].apply(lambda x : x.strip())

<ipython-input-53-cfb26696de21>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['location'] = data['location'].apply(lambda x : x.strip())

In [54]:
data['location'].value_counts()

Sadashiv Peth       134
Yerawada            134
Hingne Khurd        133
Vishrant Wadi       133
Koregaon Park       133
                   ...
Pashan              124
Law College Road    123
Karve Nagar         123
Salunke Vihar       122
other                 1
Name: location, Length: 97, dtype: int64

In [55]:
(data['total_sqft']/data['bhk']).describe()

count    12356.000000
mean       602.204242
std        388.663200
min        301.000000
25%        497.666667
50%        564.416667
75%        632.625000
max      26136.000000
dtype: float64

In [56]:
data = data[(data['total_sqft']/data['bhk']) >300]

#filtering outliers

In [57]:
def remove_outlier_sqft(df):
    df_output = pd.DataFrame()
    for key , subdf in df.groupby('location'):
        
        m = np.mean(subdf.price_per_sq_ft) #mean
        
        st =  np.std(subdf.price_per_sq_ft) #std. deviation
        
        gen_df =  subdf[(subdf.price_per_sq_ft > (m-st)) & (subdf.price_per_sq_ft <= (m+st))]
        
        df_output = pd.concat([df_output,gen_df],ignore_index=True)
        
    return df_output

data = remove_outlier_sqft(data)
data.describe()

         total_sqft          bath         price           bhk  price_per_sq_ft
count  10766.000000  10766.000000  10766.000000  10766.000000     10766.000000
mean    1491.210289      2.449471     83.341122      2.556567      5351.180064
std      854.885940      0.956267     65.338163      0.890109      1558.397099
min      340.000000      1.000000     10.000000      1.000000      1379.310345
25%     1104.000000      2.000000     48.000000      2.000000      4186.952288
50%     1280.000000      2.000000     65.000000      2.000000      5096.262741
75%     1627.965000      3.000000     95.000000      3.000000      6293.648385
max    30400.000000     16.000000   2100.000000     16.000000     17548.524329

In [58]:
def bhk_outlier(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby('location'):
        bhk_stats = {}
        for bhk, bhk_df  in location_df.groupby('bhk'):
            bhk_stats[bhk] = {
                'mean' : np.mean(bhk_df.price_per_sq_ft),
                'std' : np.std(bhk_df.price_per_sq_ft),
                'count' : bhk_df.shape[0]
            }
            
        for bhk, bhk_df  in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count']>5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sq_ft <(stats['mean'])].index.values)
    return df.drop(exclude_indices, axis = 'index')

In [59]:
data =  bhk_outlier(data)

In [60]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7351 entries, 0 to 10765
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   size             7351 non-null   object
 1   total_sqft       7351 non-null   float64
 2   bath             7351 non-null   float64
 3   price            7351 non-null   float64
 4   location         7351 non-null   object
 5   bhk              7351 non-null   int32
 6   price_per_sq_ft  7351 non-null   float64
dtypes: float64(4), int32(1), object(2)
memory usage: 430.7+ KB

In [61]:
data.drop(columns=['size','price_per_sq_ft'], inplace=True)

# cleaned Data

In [62]:
data.to_csv('cleaned_data.csv')

In [63]:
X = data.drop(columns=['price'])
y = data['price']

In [64]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression,Lasso,Ridge
from sklearn.preprocessing import OneHotEncoder,StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [65]:
X_train, X_test, y_train ,y_test = train_test_split(X, y , test_size=0.2 , random_state=0)

In [66]:
print(X_train.shape)
print(X_test.shape)

(5880, 4)
(1471, 4)

# applying Linear regression

In [67]:
column_trans = make_column_transformer((OneHotEncoder(sparse = False),['location']),remainder='passthrough')

In [68]:
scaler = StandardScaler()

In [69]:
lr = LinearRegression(normalize=True)

In [70]:
pipe = make_pipeline(column_trans,scaler,lr)

In [71]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression(normalize=True))])

In [72]:
y_pred_lr =  pipe.predict(X_test)

In [73]:
r2_score(y_test,y_pred_lr)

0.8875755278641656

# Applying Lasso

In [74]:
lasso = Lasso()

In [75]:
pipe = make_pipeline(column_trans,scaler,lasso)

In [76]:
pipe.fit(X_train,y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [77]:
y_pred_lasso =  pipe.predict(X_test)
r2_score(y_test,y_pred_lasso)

0.8860926302632984

# Applying Ridge

In [78]:
ridge = Ridge()

pipe = make_pipeline(column_trans,scaler,ridge)

pipe.fit(X_train,y_train)

y_pred_ridge =  pipe.predict(X_test)
r2_score(y_test,y_pred_ridge)

0.8875875300861784

In [114]:
data.loc(:,4443)

SyntaxError: invalid syntax (<ipython-input-114-9d30f4d0f21c>, line 1)

In [79]:
#using Ridge

In [80]:
import pickle

In [81]:
pickle.dump(pipe,open('RidgeModel.pkl','wb'))

In [82]:
test_pipe = pickle.load(open("RidgeModel.pkl",'rb'))

In [121]:
data.loc[4443,]

total_sqft    2400.0
bath             1.0
price          150.0
location      Katraj
bhk                2
Name: 4443, dtype: object

In [128]:
location = 'Aundh' 
bhk = '2'
bath = 1.0 
sqft = 900.0

input = pd.DataFrame ([[sqft,bath,location,bhk]],columns=['total_sqft','bath','location','bhk'])
# input1
prediction = pipe.predict(input)[0] * 1e5
output = str(np.round(prediction, 2))
output

'4719769.47'